lang:English

//please store all files as Unicode!

Strings:NewCode=New code
Strings:Question=Prompt
Strings:NewName=Please type in a code

Strings:LowUnmovable=The last list element can't be moved down!
Strings:HighUnmovable=The highest list element can't be moved up!

Strings:Attention=Caution!
Strings:CodeChange=The codes have changed, do you want to store them?\nThis modification will only be done in application memory, your TXT file won't be modified!\nIf you deny, the code changes will be dropped!

Strings:Duplicated=duplicated

Strings:Stored=Stored!
Strings:InvalidLine=Invalid line: %s
Strings:NameMissing=Please type in a code name!
Strings:NoSelection=No code selected
Strings:InvalidID=Invalid game id - only the name will be stored.

Strings:ChangeBeforeExport=Codes were changed. Do you want to apply the changes otherwise they won't be stored to the final GCT file.
Strings:CodeError1=Error at code:
Strings:CodeError2=Probably you need to replace all placeholders (XX) first.
Strings:NoGameId=No game ID set. Do you want to continue anyway?
Strings:Error=Error
Strings:StoredTo=GCT file saved to: %s
Strings:SaveError=Saving error

Strings:Credits=Ocarina Cheat Code Manager\n\nCode list concept by James0x57\nCode Manager by Link\nGecko OS by brkirch and Nuke

Strings:RemoveQuest=Are you sure? This cannot be undone!

MainForm:_:_:Caption=Gecko Cheat Code Manager

MainForm:FileMenu:WMENUITEM:Caption=File
MainForm:NewL:WMENUITEM:Caption=New list
MainForm:OpenTXTfile:WMENUITEM:Caption=Open TXT file
MainForm:StoreTXT:WMENUITEM:Caption=Store TXT file
MainForm:ExporttoGCT:WMENUITEM:Caption=Export to GCT
MainForm:Closeprog:WMENUITEM:Caption=Close application

MainForm:RemoveSel:WMENUITEM:Caption=Remove selected
MainForm:AllDown:WMENUITEM:Caption=Move down all selected
MainForm:AllUp:WMENUITEM:Caption=Move up all selected
MainForm:DuplicateSelected:WMENUITEM:Caption=Duplicate all selected codes
MainForm:BottomSend:WMENUITEM:Caption=Send to bottom

MainForm:OptionsMenu:WMENUITEM:Caption=Options
MainForm:LangMenu:WMENUITEM:Caption=Language

MainForm:AboutMenu:WMENUITEM:Caption=?
MainForm:AboutSelect:WMENUITEM:Caption=About

MainForm:GidBox:WGROUPBOX:Caption=Game ID
MainForm:GNameBox:WGROUPBOX:Caption=Game Name
MainForm:StBtn:WBUTTON:Caption=Store ID/Name

MainForm:AddCode:WBUTTON:Caption=Add code/category/comment

MainForm:CodeNameBox:WGROUPBOX:Caption=Code/Comment/Category Name
MainForm:CodeContBox:WGROUPBOX:Caption=Code contents (leave empty for comment/category)
MainForm:CommentGroup:WGROUPBOX:Caption=Code comment (leave empty for category)
MainForm:CmtType:WCOMBOBOX:Item0=Unique comment:
MainForm:CmtType:WCOMBOBOX:Item1=Import comment from:
MainForm:StoreMods:WBUTTON:Caption=Store modifications

MainForm:GCTExport:WBUTTON:Caption=Export to GCT


Strings:NoValidDrive=No valid drive selected!
Strings:StoringTo=Codes will be stored to: %s

//Line has to be adjusted for new version!
SaveForm:_:_:Caption=Export Manager

SaveForm:HardGroup:WGROUPBOX:Caption=Store to file
SaveForm:StoreHard:WBUTTON:Caption=Store to file

SaveForm:SDGroup:WGROUPBPX:Caption=Store to SD card
SaveForm:DriveLabel:WLABEL:Caption=Drive letter:
SaveForm:StoreTo:WPANEL:Caption=No valid drive selected!
SaveForm:StoreSecure:WBUTTON:Caption=Store
SaveForm:CncButton:WBUTTON:Caption=Cancel

//-------------------- Additions since the last version

GeckoForm:StatusBox:WLABEL:Caption=Store to SD card

Strings:DialogOK=Ok
Strings:DialogCancel=Cancel

Strings:TOOMANYCODES=More than 256 lines of code active!\nDo you want to continue anyway?

